#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_availability_zones.available: Reading...
module.iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::339713111345:policy/terraform-example-policy]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_iam_role.my_role: Refreshing state... [id=role_created_by_terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam_policy.aws_iam_policy.policy[0] must be replaced
-/+ resource "aws_iam_policy" "policy" {
      ~ arn         = "arn:aws:iam::339713111345:policy/terraform-example-policy" -> (known after apply)
      ~ description = "My terraform example policy" -> "My terraform policy for test" # forces replacement
      ~ id          = "arn:aws:iam::339713111345:policy/terraform-example-policy" -> (known after apply)
        name        = "terraform-example-policy"
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAU6GD2WUYU7QPLV5VY" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ iam_policy_arn                   = "arn:aws:iam::339713111345:policy/terraform-example-policy" -> (known after apply)
  ~ iam_policy_description           = "My terraform example policy" -> "My terraform policy for test"
  ~ iam_policy_id                    = "arn:aws:iam::339713111345:policy/terraform-example-policy" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @pedrofurtado, Action: `pull_request`, Workflow: `Pull Request to Main`*